#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shapeshed/asimo/runs/run-9j3Zjk6PvLKvbHXX

Waiting for the plan to start...

Terraform v1.4.0
on linux_amd64
Initializing plugins and modules...
module.s3-us-east-1["com.shapeshed.auster"].data.aws_caller_identity.current: Refreshing...
aws_acm_certificate.samornbo-com: Refreshing state... [id=arn:aws:acm:us-east-1:535487841971:certificate/653e8067-067e-4362-900e-32d00c5629ad]
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_caller_identity.current: Refreshing...
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_canonical_user_id.this: Refreshing...
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_caller_identity.current: Refreshing...
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_caller_identity.current: Refreshing...
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_canonical_user_id.this: Refreshing...
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_caller_identity.current: Refreshing...
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_canonical_user_id.this: Refreshing...
module.s3-us-east-1["com.shapeshed.auster"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
module.s3-us-east-1["com.shapeshed.auster"].data.aws_canonical_user_id.this: Refreshing...
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_canonical_user_id.this: Refreshing...
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_caller_identity.current: Refresh complete after 0s [id=535487841971]
aws_acm_certificate.cert-shapeshed-com: Refreshing state... [id=arn:aws:acm:us-east-1:535487841971:certificate/558d6912-425b-4002-8c7f-6a7fe9b9d408]
aws_s3_bucket.samornbo-com: Refreshing state... [id=samornbo.com]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.clearmatics]
module.s3-us-east-1["com.shapeshed.orwell"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.wozniak]
module.s3-us-east-1["com.shapeshed.clearmatics"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.wozniak"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.orwell]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.auster]
module.s3-us-east-1["com.shapeshed.cdn"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.auster"].data.aws_canonical_user_id.this: Refresh complete after 0s [id=ae4ea1ba34cdfa87e708327e731da03ee8a647fbcf8e6b225b83987112e58c90]
module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket.this[0]: Refreshing state... [id=com.shapeshed.cdn]
module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.cdn,private]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.clearmatics,private]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.auster,private]
module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.wozniak,private]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.auster:general]
module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.wozniak:general]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket_acl.this[0]: Refreshing state... [id=com.shapeshed.orwell,private]
module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.cdn:general]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.clearmatics:general]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket_intelligent_tiering_configuration.this["general"]: Refreshing state... [id=com.shapeshed.orwell:general]
aws_s3_bucket_acl.samornbo-com: Refreshing state... [id=samornbo.com,private]
aws_s3_bucket_versioning.samornbo-com: Refreshing state... [id=samornbo.com]
aws_s3_bucket_public_access_block.samornbo-com: Refreshing state... [id=samornbo.com]
module.s3-us-east-1["com.shapeshed.wozniak"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.wozniak]
module.s3-us-east-1["com.shapeshed.auster"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.auster]
module.s3-us-east-1["com.shapeshed.cdn"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.cdn]
module.s3-us-east-1["com.shapeshed.clearmatics"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.clearmatics]
module.s3-us-east-1["com.shapeshed.orwell"].aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=com.shapeshed.orwell]
aws_route53_zone.shapeshed_com: Refreshing state... [id=Z0914809299OFXJQ90CQ9]
aws_s3_bucket.static-shapeshed-com: Refreshing state... [id=static.shapeshed.com]
aws_cloudfront_origin_access_control.samornbo-com: Refreshing state... [id=E3MTFI3TIGX1NE]
aws_route53_zone.samornbo-com: Refreshing state... [id=Z00253943FAW86XB9US01]
aws_s3_bucket.creative-corners: Refreshing state... [id=creative-corners]
aws_s3_bucket.photos-shapeshed-com: Refreshing state... [id=photos.shapeshed.com]
aws_cloudfront_distribution.samornbo-com: Refreshing state... [id=E1FHIEOD6JROUU]
aws_route53_record.googlee87068e8125fba47_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_googlee87068e8125fba47.shapeshed.com_CNAME]
aws_route53_record.__acme-challenge_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9__acme-challenge.shapeshed.com_TXT]
aws_route53_record.shapeshed_com_NS: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_NS]
aws_route53_record.moxie_shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_AAAA]
aws_route53_record.w6yzyrt6eyqt_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_w6yzyrt6eyqt.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_TXT]
aws_route53_record.moxie_shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_moxie.shapeshed.com_A]
aws_route53_record.shgsbo4u9t_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shgsbo4u9t.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_SOA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_SOA]
aws_route53_record.yandex-verification_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_yandex-verification.shapeshed.com_TXT]
aws_route53_record.__dmarc_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9__dmarc.shapeshed.com_TXT]
aws_route53_record.d78e316caf6d1de59613b2e5a7e0d62b_shapeshed_com_CNAME: Refreshing state... [id=Z0914809299OFXJQ90CQ9_d78e316caf6d1de59613b2e5a7e0d62b.shapeshed.com_CNAME]
aws_route53_record.shapeshed__domainkey_shapeshed_com_TXT: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed._domainkey.shapeshed.com_TXT]
aws_route53_record.shapeshed_com_acm_validation["*.shapeshed.com"]: Refreshing state... [id=Z0914809299OFXJQ90CQ9__26eca8f67eb273a9cafb25ef1989fdf1.shapeshed.com_CNAME]
aws_route53_record.shapeshed_com_acm_validation["shapeshed.com"]: Refreshing state... [id=Z0914809299OFXJQ90CQ9__26eca8f67eb273a9cafb25ef1989fdf1.shapeshed.com_CNAME]
aws_route53_record.samornbo-com_A: Refreshing state... [id=Z00253943FAW86XB9US01_samornbo.com_A]
aws_route53_record.shapeshed_com_MX: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_MX]
aws_route53_record.samornbo-com_AAAA: Refreshing state... [id=Z00253943FAW86XB9US01_samornbo.com_AAAA]
aws_route53_record.samornbo_com_acm_validation["*.samornbo.com"]: Refreshing state... [id=Z00253943FAW86XB9US01__d942f6056bffc9341b15dc18a61b3093.samornbo.com._CNAME]
aws_route53_record.samornbo_com_acm_validation["samornbo.com"]: Refreshing state... [id=Z00253943FAW86XB9US01__d942f6056bffc9341b15dc18a61b3093.samornbo.com._CNAME]
aws_acm_certificate_validation.cert-shapeshed-com-validation: Refreshing state... [id=2023-02-28 20:54:30.75 +0000 UTC]
aws_acm_certificate_validation.samornbo-com: Refreshing state... [id=2023-03-14 13:33:41.632 +0000 UTC]
aws_s3_bucket_public_access_block.photos-shapeshed-com: Refreshing state... [id=photos.shapeshed.com]
aws_s3_bucket_versioning.photos-shapeshed-com: Refreshing state... [id=photos.shapeshed.com]
aws_s3_bucket_acl.photos-shapeshed-com: Refreshing state... [id=photos.shapeshed.com,private]
aws_s3_bucket_public_access_block.static-shapeshed-com: Refreshing state... [id=static.shapeshed.com]
aws_cloudfront_origin_access_control.static-shapeshed-com: Refreshing state... [id=E1IIZUUZGRNE2J]
aws_s3_bucket_versioning.static-shapeshed-com: Refreshing state... [id=static.shapeshed.com]
aws_s3_bucket_acl.static-shapeshed-com: Refreshing state... [id=static.shapeshed.com,private]
aws_s3_bucket_versioning.creative-corners-bucket_versioning: Refreshing state... [id=creative-corners]
aws_s3_bucket_public_access_block.creative-corners_public_access_block: Refreshing state... [id=creative-corners]
aws_s3_bucket_acl.creative-corners_acl: Refreshing state... [id=creative-corners,private]
aws_cloudfront_distribution.cf-shapeshed-com: Refreshing state... [id=EOEO7HZP7EIIC]
aws_route53_record.shapeshed_com_A: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_A]
aws_route53_record.shapeshed_com_AAAA: Refreshing state... [id=Z0914809299OFXJQ90CQ9_shapeshed.com_AAAA]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.us_east_1_backups["com.shapeshed.bomberg"] will be created
  + resource "aws_s3_bucket" "us_east_1_backups" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "com.shapeshed.bomberg"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.us_east_1_backups["com.shapeshed.bomberg"] will be created
  + resource "aws_s3_bucket_acl" "us_east_1_backups" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_public_access_block.us_east_1_backups["com.shapeshed.bomberg"] will be created
  + resource "aws_s3_bucket_public_access_block" "us_east_1_backups" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_versioning.us_east_1_backups["com.shapeshed.bomberg"] will be created
  + resource "aws_s3_bucket_versioning" "us_east_1_backups" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Suspended"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @shapeshed, Action: `pull_request`*